2023-9-27/2a09fa83bd-STDY.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 16:46 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>devicetree</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">devicetree</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc78ba49">1. Device Tree usage</a>
<ul>
<li><a href="#org1bf6965">1.1. Basic Data Format</a></li>
<li><a href="#orgbb8445f">1.2. Basic Concepts</a></li>
<li><a href="#org0b9b951">1.3. How Addressing Works</a></li>
<li><a href="#org11bdea3">1.4. How Interrupts Work</a></li>
<li><a href="#org14ef8f9">1.5. Device Specific Data</a></li>
<li><a href="#orga98a5b5">1.6. Special Nodes</a></li>
<li><a href="#org6ccca2f">1.7. Advanced Topics</a></li>
<li><a href="#org8cefede">1.8. Notes</a></li>
</ul>
</li>
<li><a href="#orgab973d1">2. of_unittest.rst</a>
<ul>
<li><a href="#org26a5cb5">2.1. Test-data</a></li>
<li><a href="#orgffc5ca5">2.2. Adding the test data</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Kernel支持一套平台无关的设备树测试用例,执行OF unittest所需的测试数据如何附着到live tree上;
</p>

<div id="outline-container-orgc78ba49" class="outline-2">
<h2 id="orgc78ba49"><span class="section-number-2">1.</span> Device Tree usage</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://www.devicetree.org/Device_Tree_Usage">http://www.devicetree.org/Device_Tree_Usage</a>
此文档walk through如何为一个新机器写设备树. 目标是提供设备树观念概述和如何使用他们描述一个机器;
设备树格式的详细描述查看<a href="https://elinux.org/images/c/cf/Power_ePAPR_APPROVED_v1.1.pdf">https://elinux.org/images/c/cf/Power_ePAPR_APPROVED_v1.1.pdf</a>
ePAPR当前采用一个新的名字进行更新: Devicetree Specification Documentation
</p>
</div>
<div id="outline-container-org1bf6965" class="outline-3">
<h3 id="org1bf6965"><span class="section-number-3">1.1.</span> Basic Data Format</h3>
<div class="outline-text-3" id="text-1-1">
<p>
属性键值对:
文本字符串:
string-property="a string";
32bit无符号整数采用对角括号:
cell-property=&lt;0xbeef 123 0xabcd1234&gt;;
二进制数据采用方括号:
binary-property=[0x1 0x23 0x45 0x67];
代表不同类型的数据采用逗号拼接混合:
mixed-property="a string", [0x01 0x23 0x45 0x67], &lt;0x12345678&gt;;
逗号用来创建字符串列表:
string-list="red fish","blue fish";
</p>
</div>
</div>
<div id="outline-container-orgbb8445f" class="outline-3">
<h3 id="orgbb8445f"><span class="section-number-3">1.2.</span> Basic Concepts</h3>
<div class="outline-text-3" id="text-1-2">
<p>
制造商 Acme || 名字 Coyote's Revenge 
</p>
<ul class="org-ul">
<li>One 32bit ARM CPU</li>
<li>processor local bus attached to memory mapped serial port, spi bus controller, i2c controller, interrupt controller, and external bus bridge</li>
<li>256MB of SDRAM based at 0</li>
<li>2 Serial ports based at 0x101F1000 and 0x101F2000</li>
<li>GPIO controller based at 0x101F3000</li>
<li>SPI controller based at 0x10170000 with following devices
<ul class="org-ul">
<li>MMC slot with SS pin attached to GPIO#1</li>
</ul></li>
<li>External bus bridge with following devices
<ul class="org-ul">
<li>SMC SMC91111 Ethernet device attached to external bus based at 0x10100000</li>
<li>i2c controller based at 0x10160000 with following devices
<ul class="org-ul">
<li>Maxim DS1338 real time clock. Responds to slave address 1101000(0x58)</li>
</ul></li>
<li>64MB of NOR flash based at 0x30000000</li>
</ul></li>
</ul>

<p>
Initial structure
</p>
<div class="org-src-container">
<pre class="src src-c">  /dts-v1/:
  / {
  compatible=<span style="font-style: italic;">"acme,coyotes-revenge"</span>;
};
</pre>
</div>
<p>
compatible="&lt;manufacturer&gt;,&lt;model&gt;";
</p>

<p>
CPUs
</p>
<div class="org-src-container">
<pre class="src src-c">    /dts-v1/:
    / {
    compatible=<span style="font-style: italic;">"acme,coyotes-revenge"</span>;

    cpus{
          cpu@0 {
                compatible=<span style="font-style: italic;">"arm,cortex-a9"</span>;
          };
          cpu@1 {
                compatible=<span style="font-style: italic;">"arm,cortex-a9"</span>;
          };
    };
  };
</pre>
</div>

<p>
Node Names
&lt;name&gt;[@&lt;unit-address&gt;]
name简单ascii字符串,最多31字符.
unit-address,用来访问设备的主地址,在节点的reg属性中重复描述.
姊妹节点的命名必须唯一,但可以name相同,address不同(serial@101f1000 &amp; serial@101f2000)
</p>

<p>
Devices
</p>
<div class="org-src-container">
<pre class="src src-c">  /dts-v1/;

  / {
        compatible = <span style="font-style: italic;">"acme,coyotes-revenge"</span>;

        cpus {
              cpu@0 {
                    compatible = <span style="font-style: italic;">"arm,cortex-a9"</span>;
              };
              cpu@1 {
                    compatible = <span style="font-style: italic;">"arm,cortex-a9"</span>;
              };
        };

        serial@101F0000 {
              compatible = <span style="font-style: italic;">"arm,pl011"</span>;
        };

        serial@101F2000 {
              compatible = <span style="font-style: italic;">"arm,pl011"</span>;
        };

        gpio@101F3000 {
              compatible = <span style="font-style: italic;">"arm,pl061"</span>;
        };

        interrupt-controller@10140000 {
              compatible = <span style="font-style: italic;">"arm,pl190"</span>;
        };

        spi@10115000 {
              compatible = <span style="font-style: italic;">"arm,pl022"</span>;
        };

        external-bus {
              ethernet@0,0 {
                    compatible = <span style="font-style: italic;">"smc,smc91c111"</span>;
              };

              i2c@1,0 {
                    compatible = <span style="font-style: italic;">"acme,a1234-i2c-bus"</span>;
                    rtc@58 {
                          compatible = <span style="font-style: italic;">"maxim,ds1338"</span>;
                    };
              };

              flash@2,0 {
                    compatible = <span style="font-style: italic;">"samsung,k8f1315ebm"</span>, <span style="font-style: italic;">"cfi-flash"</span>;
              };
        };
   };
</pre>
</div>
<p>
设备树中的层级是CPU视角;
每个节点都有compatible属性;
flash节点有两个字符串;
</p>

<p>
Understanding the compatible Property
OS用compatible属性判断将哪个设备驱动绑定到设备上;
compatible是一个字符串列表,第一个字符串精准指向节点代表的设备,格式是"&lt;manufacturer&gt;,&lt;model&gt;",下一个代表设备兼容的其他设备;
如Freescale的MPC8349 Soc有一个串口设备,实现了National Semiconductor ns16550寄存器接口: compatible="fsl,mpc8349-uart","ns16550";此例中,"fsl,mpc8349-uart"指向精准设备,ns16550代表这是一个寄存器级别兼容National semiconductor 16550 UART的设备;
ns16550没有manufacturer纯粹是历史原因,所有新的兼容值需要使用采用manufacturer前缀;
</p>
</div>
</div>
<div id="outline-container-org0b9b951" class="outline-3">
<h3 id="org0b9b951"><span class="section-number-3">1.3.</span> How Addressing Works</h3>
<div class="outline-text-3" id="text-1-3">
<p>
CPU addressing
</p>
<div class="org-src-container">
<pre class="src src-c">  cpus {
<span style="font-weight: bold;">  #address</span>-cells = &lt;1&gt;;
<span style="font-weight: bold;">  #size</span>-cells = &lt;0&gt;;
        cpu@0 {
              compatible = <span style="font-style: italic;">"arm,cortex-a9"</span>;
              reg = &lt;0&gt;;
        };
        cpu@1 {
              compatible = <span style="font-style: italic;">"arm,cortex-a9"</span>;
              reg = &lt;1&gt;;
        };
  };
</pre>
</div>
<p>
CPU节点可以代表最简单的用例,来说明addressing. 每一个CPU分配一个独一无二的ID,没有和id相关的size;
约定,如果节点有reg属性,那name@unit-address中的@unit-address不可省略,并且是reg属性中的第一个地址值;
</p>

<p>
Memory Mapped Devices
</p>
<div class="org-src-container">
<pre class="src src-c">  /dts-v1/;

  / {
<span style="font-weight: bold;">  #address</span>-cells = &lt;1&gt;;
<span style="font-weight: bold;">  #size</span>-cells = &lt;1&gt;;

        ...

              serial@101f0000 {
              compatible = <span style="font-style: italic;">"arm,pl011"</span>;
              reg = &lt;0x101f0000 0x1000 &gt;;
        };

        serial@101f2000 {
              compatible = <span style="font-style: italic;">"arm,pl011"</span>;
              reg = &lt;0x101f2000 0x1000 &gt;;
        };

        gpio@101f3000 {
              compatible = <span style="font-style: italic;">"arm,pl061"</span>;
              reg = &lt;0x101f3000 0x1000
                    0x101f4000 0x0010&gt;;
        };

        interrupt-controller@10140000 {
              compatible = <span style="font-style: italic;">"arm,pl190"</span>;
              reg = &lt;0x10140000 0x1000 &gt;;
        };

        spi@10115000 {
              compatible = <span style="font-style: italic;">"arm,pl022"</span>;
              reg = &lt;0x10115000 0x1000 &gt;;
        };

        ...

              };
</pre>
</div>
<p>
一些设备所在的bus有不同的地址策略. 例如,设备可以附着于一个外部bus上,此bus带有片选线.
</p>
<div class="org-src-container">
<pre class="src src-c">  external-bus {
<span style="font-weight: bold;">  #address</span>-cells = &lt;2&gt;;
<span style="font-weight: bold;">  #size</span>-cells = &lt;1&gt;;

        ethernet@0,0 {
              compatible = <span style="font-style: italic;">"smc,smc91c111"</span>;
              reg = &lt;0 0 0x1000&gt;;
        };

        i2c@1,0 {
              compatible = <span style="font-style: italic;">"acme,a1234-i2c-bus"</span>;
              reg = &lt;1 0 0x1000&gt;;
              rtc@58 {
                    compatible = <span style="font-style: italic;">"maxim,ds1338"</span>;
              };
        };

        flash@2,0 {
              compatible = <span style="font-style: italic;">"samsung,k8f1315ebm"</span>, <span style="font-style: italic;">"cfi-flash"</span>;
              reg = &lt;2 0 0x4000000&gt;;
        };
  };
</pre>
</div>
<p>
external-bus使用2 cells作为地址值;一个作为芯片选择号,另一个作为芯片偏移值;
</p>

<p>
Non Memory Mapped Devices
</p>
<div class="org-src-container">
<pre class="src src-c">  i2c@1,0 {
        compatible = <span style="font-style: italic;">"acme,a1234-i2c-bus"</span>;
<span style="font-weight: bold;">  #address</span>-cells = &lt;1&gt;;
<span style="font-weight: bold;">  #size</span>-cells = &lt;0&gt;;
        reg = &lt;1 0 0x1000&gt;;
        rtc@58 {
              compatible = <span style="font-style: italic;">"maxim,ds1338"</span>;
              reg = &lt;58&gt;;
        };
  };
</pre>
</div>
<p>
其他设备并不映射到处理器总线地址上.设备节点有地址,但不直接被CPU访问;
</p>
</div>
</div>

<div id="outline-container-org11bdea3" class="outline-3">
<h3 id="org11bdea3"><span class="section-number-3">1.4.</span> How Interrupts Work</h3>
</div>
<div id="outline-container-org14ef8f9" class="outline-3">
<h3 id="org14ef8f9"><span class="section-number-3">1.5.</span> Device Specific Data</h3>
</div>
<div id="outline-container-orga98a5b5" class="outline-3">
<h3 id="orga98a5b5"><span class="section-number-3">1.6.</span> Special Nodes</h3>
</div>
<div id="outline-container-org6ccca2f" class="outline-3">
<h3 id="org6ccca2f"><span class="section-number-3">1.7.</span> Advanced Topics</h3>
</div>
<div id="outline-container-org8cefede" class="outline-3">
<h3 id="org8cefede"><span class="section-number-3">1.8.</span> Notes</h3>
</div>
</div>
<div id="outline-container-orgab973d1" class="outline-2">
<h2 id="orgab973d1"><span class="section-number-2">2.</span> of_unittest.rst</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org26a5cb5" class="outline-3">
<h3 id="org26a5cb5"><span class="section-number-3">2.1.</span> Test-data</h3>
<div class="outline-text-3" id="text-2-1">
<p>
drivers/of/unittest-data/testcases.dts 包含在 drivers/of/unittest.c 所需的自动测试数据;
当前,一下dts包括进了testcases.dts:
drivers/of/unittest-data/tests-interrupts.dtsi
drivers/of/unittest-data/tests-platform.dtsi
drivers/of/unittest-data/tests-phandle.dtsi
drivers/of/unittest-data/tests-match.dtsi
</p>

<p>
内核使能OF_SELFTEST后,会有以下规则:
</p>
<div class="org-src-container">
<pre class="src src-makefile">  <span style="font-weight: bold;">$(</span><span style="font-weight: bold; font-style: italic;">obj</span><span style="font-weight: bold;">)/%.dtb</span>: $(<span style="font-weight: bold; font-style: italic;">src</span>)/%.dts FORCE
              $(<span style="font-weight: bold; font-style: italic;">call</span> if_changed_dep, dtc)
</pre>
</div>
<p>
编译testcases.dts -&gt; testcases.dtb, 后者作为平坦DT被引用;
之后,采用以下依赖进行包裹:
</p>
<div class="org-src-container">
<pre class="src src-makefile">  <span style="font-weight: bold;">$(</span><span style="font-weight: bold; font-style: italic;">obj</span><span style="font-weight: bold;">)/%.dtb.S</span>: $(<span style="font-weight: bold; font-style: italic;">obj</span>)/%.dtb
              $(<span style="font-weight: bold; font-style: italic;">call</span> cmd, dt_S_dtb)
</pre>
</div>
<p>
之后,*.dtb.S -&gt; testcases.dtb.o, 后者链接进内核;
</p>
</div>
</div>
<div id="outline-container-orgffc5ca5" class="outline-3">
<h3 id="orgffc5ca5"><span class="section-number-3">2.2.</span> Adding the test data</h3>
<div class="outline-text-3" id="text-2-2">
<p>
非平坦设备树结构由树结构连接的device_node组成:
</p>
<div class="org-src-container">
<pre class="src src-c">  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">following struct members are used to construct the tree</span>
  <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">device_node</span> {
        ...
        <span style="font-weight: bold;">struct</span>  device_node *parent;
        <span style="font-weight: bold;">struct</span>  <span style="font-weight: bold; text-decoration: underline;">device_node</span> *<span style="font-weight: bold; font-style: italic;">child</span>;
        <span style="font-weight: bold;">struct</span>  <span style="font-weight: bold; text-decoration: underline;">device_node</span> *<span style="font-weight: bold; font-style: italic;">sibling</span>;
        ...
  };
</pre>
</div>
<p>
非平坦设备树的通用结构,只考虑sibling和child指针;
parent指针用来反向遍历设备树;
    root ('/')
</p>
<table>


<tbody>
<tr>
</tr>
</tbody>
</table>
<p>
child1 -&gt; sibling2 -&gt; sibling3 -&gt; sibling4 -&gt; null
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">null</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">child31 -&gt; sibling32 -&gt; null</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">null       null</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">child21 -&gt; sibling22 -&gt; sibling23 -&gt; null</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">null       null         null</td>
</tr>
<tbody>
<tr>
</tr>
</tbody>
</table>
<p>
child11 -&gt; sibling12 -&gt; sibling13 -&gt; sibling14 -&gt; null
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">null</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
null        null       child131 -&gt; null
</p>
<table>


<tbody>
<tr>
</tr>
</tbody>
</table>
<p>
null
</p>

<p>
执行OF unittest前,需要将测试数据附着到机器设备树;因此,当selftest_data_add()调用时,他首先读取通过以下内核符号链接进内核镜像的平坦设备树:
    __dtb_testcases_begin - address marking the start of test data blob
    __dtb_testcases_end   - address marking the end of test data blob
</p>

<p>
之后,调用of_fdt_unflatten_tree()将平坦设备树进行非平坦化;
最后,如果机器设备树(live tree)存在.将非平坦测试数据附着进live tree,否则将自己作为一个live device tree;
attach_node_and_children() 使用 of_attach_node()将节点放进live tree中;
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 16:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
